# Pandas

Pandas is an open source library of python that is used for handle data manipulations.

In [3]:
import pandas as pd

In [7]:
# Data Sturcture of pandas :->

# (a). series -->  it is 1-d array and it shows only values.
# (b). Dataframe -->  it is multi-dimensional array and it contains value with column name.

# (a). Series

In [14]:
a = pd.Series([1,45,78,99])
a

0     1
1    45
2    78
3    99
dtype: int64

In [16]:
type(a)

pandas.core.series.Series

# (b). Dataframe

In [19]:
a = {
    "emp_id" : [1,2,3,4],
    "name" : ["sam", " raj" , "mohit", "hardik"],
    "department" : ['it', 'sales' , 'it','it'],
    "salary" : [20000,45000,25000,100000]
    
}

In [23]:
df = pd.DataFrame(a)
df

   emp_id    name department  salary
0       1     sam         it   20000
1       2     raj      sales   45000
2       3   mohit         it   25000
3       4  hardik         it  100000

In [33]:
df.to_csv("C:\\Users\\hardi\\OneDrive - wipro\\Desktop\\panda\\emp_info.csv", index=False)